In [1]:
import pandas as pd

df = pd.read_csv("https://python4ds.s3-ap-northeast-1.amazonaws.com/olympics.csv", index_col=0)
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,ID
Afghanistan,13,0,0,2,2,0,0,0,0,0,13,0,0,2,2,AFG
Algeria,12,5,2,8,15,3,0,0,0,0,15,5,2,8,15,ALG
Argentina,23,18,24,28,70,18,0,0,0,0,41,18,24,28,70,ARG
Armenia,5,1,2,9,12,6,0,0,0,0,11,1,2,9,12,ARM
Australasia,2,3,4,5,12,0,0,0,0,0,2,3,4,5,12,ANZ

In [2]:
#哪個國家金牌最多
def answer_one(df):
    return df['Gold'].idxmax()
answer_one(df)

'United States'

In [3]:
#哪個國家夏季奧運與冬季奧運的金牌數差距數最大？
def answer_two(df):
    gold_diff = (df['Gold'] - df['Gold.1']).abs() #絕對值
    return gold_diff.idxmax()
answer_two(df)

'United States'

In [4]:
#哪個國家夏季奧運與冬季奧運的金牌數差距除以總金牌數的比例最大？（僅考慮至少有一個夏季金牌與一個冬季金牌的國家）
def answer_three(df):
    ratio = (df['Gold'] - df['Gold.1']) / df['Gold.2']
    return ratio[ratio != 1].idxmax()
answer_three(df)

'Bulgaria'

In [5]:
#計算 146 個國家的獎牌點數，金牌 3 點、銀牌 2 點、銅牌 1 點
def answer_four(df):
    medal_points = df['Gold.2']*3 + df['Silver.2']*2 + df['Bronze.2']
    return medal_points
answer_four(df).size
answer_four(df)

Afghanistan                           2
Algeria                              27
Argentina                           130
Armenia                              16
Australasia                          22
                                   ...
Yugoslavia                          171
Independent Olympic Participants      4
Zambia                                3
Zimbabwe                             18
Mixed team                           38
Length: 146, dtype: int64

In [6]:
#DataFrame 進階技巧

In [7]:
import numpy as np
ser = pd.Series([5, None, 6, np.NaN])
print(ser.isnull())
print("\n")
print(ser.notnull())

0    False
1     True
2    False
3     True
dtype: bool


0     True
1    False
2     True
3    False
dtype: bool

In [8]:
ser = pd.Series([5, None, 6, np.NaN])
print(ser)
print("\n")
ser.dropna()

0    5.0
1    NaN
2    6.0
3    NaN
dtype: float64

0    5.0
2    6.0
dtype: float64

In [9]:
df = pd.DataFrame([
    [1,      np.nan, 7.],
    [2,      5,      8.],
    [np.nan, 6,      9.]
])
df

     0    1    2
0  1.0  NaN  7.0
1  2.0  5.0  8.0
2  NaN  6.0  9.0

In [10]:
df.dropna() #dropna是全砍,容易造成不平衡

     0    1    2
1  2.0  5.0  8.0

In [11]:
df.dropna(axis=1) #垂直

     2
0  7.0
1  8.0
2  9.0

In [12]:
#填補
ser = pd.Series([5, None, 6, np.NaN])
print(ser)
print("\n")
ser.fillna(5566) #碰到nan就用5566取代

0    5.0
1    NaN
2    6.0
3    NaN
dtype: float64

0       5.0
1    5566.0
2       6.0
3    5566.0
dtype: float64

In [13]:
#遇到nan用前一筆或後一筆資料填補
ser = pd.Series([5, None, 6, np.NaN, 7])
print(ser)
print("\n")
print(ser.fillna(method='ffill'))
print("\n")
print(ser.fillna(method='bfill'))

0    5.0
1    NaN
2    6.0
3    NaN
4    7.0
dtype: float64


0    5.0
1    5.0
2    6.0
3    6.0
4    7.0
dtype: float64


0    5.0
1    6.0
2    6.0
3    7.0
4    7.0
dtype: float64

In [14]:
#分組摘要
player_profile = pd.read_csv("https://python4ds.s3-ap-northeast-1.amazonaws.com/player_profile.csv")
groupby_object = player_profile.groupby(["pos", "country"]) #加入country分組,讓結果會再細分(多層索引)

In [15]:
mean_height_by_pos_count =  groupby_object["heightMeters"].mean()
print(mean_height_by_pos_count) # Average height by pos and country
print(type(groupby_object["heightMeters"].mean().index))

pos  country
C    Austria                   2.130000
     Bahamas                   2.160000
     Bosnia and Herzegovina    2.130000
     Canada                    2.060000
     Croatia                   2.135000
                                 ...
G-F  France                    2.006667
     Italy                     1.960000
     Japan                     2.060000
     Turkey                    2.010000
     USA                       1.993214
Name: heightMeters, Length: 88, dtype: float64
<class 'pandas.core.indexes.multi.MultiIndex'>

In [16]:
mean_height_by_pos_count

pos  country
C    Austria                   2.130000
     Bahamas                   2.160000
     Bosnia and Herzegovina    2.130000
     Canada                    2.060000
     Croatia                   2.135000
                                 ...
G-F  France                    2.006667
     Italy                     1.960000
     Japan                     2.060000
     Turkey                    2.010000
     USA                       1.993214
Name: heightMeters, Length: 88, dtype: float64

In [17]:
mean_height_by_pos_count['G']

country
Australia                           1.920000
Bahamas                             1.930000
Brazil                              1.850000
Canada                              1.941429
Democratic Republic of the Congo    1.960000
France                              1.970000
Germany                             1.940000
Lithuania                           2.030000
Nigeria                             1.930000
Serbia                              1.980000
Slovenia                            1.900000
Spain                               1.930000
USA                                 1.921676
Ukraine                             2.030000
Yugoslavia                          1.980000
Name: heightMeters, dtype: float64

In [18]:
mean_height_by_pos_count['G','USA']

1.9216763005780348

In [19]:
mean_height_by_pos_count[['F-G','G-F']]

pos  country
F-G  Canada                    2.020000
     France                    2.030000
     Slovenia                  2.010000
     USA                       1.986364
G-F  Australia                 2.045000
     Bosnia and Herzegovina    2.060000
     Canada                    1.980000
     Czech Republic            2.010000
     France                    2.006667
     Italy                     1.960000
     Japan                     2.060000
     Turkey                    2.010000
     USA                       1.993214
Name: heightMeters, dtype: float64

In [20]:
mean_height_by_pos_count[['F-G','G-F']][:,'USA'] #第一層全都要所以用:,第二層要USA

pos
F-G    1.986364
G-F    1.993214
Name: heightMeters, dtype: float64

In [21]:
player_profile = pd.read_csv("https://python4ds.s3-ap-northeast-1.amazonaws.com/player_profile.csv")
wide_format = player_profile[["temporaryDisplayName", "heightMeters", "weightKilograms"]]
wide_format.head()

  temporaryDisplayName  heightMeters  weightKilograms
0        Adams, Steven          2.13            120.2
1         Adebayo, Bam          2.08            115.7
2           Adel, Deng          2.01             90.7
3   Aldridge, LaMarcus          2.11            117.9
4      Alexander, Kyle          2.11             99.8

In [22]:
#轉成長表格
#ID_VARS= 轉置時NAME不動,其他的要跟著動
#value_vars = 要動的
#var_name = 因長表格的欄位名稱要自己宣告
long_format = pd.melt(wide_format, id_vars="temporaryDisplayName", value_vars=["heightMeters", "weightKilograms"], var_name="key", value_name="value")
long_format.sort_values("temporaryDisplayName").head(10)

    temporaryDisplayName              key   value
0          Adams, Steven     heightMeters    2.13
524        Adams, Steven  weightKilograms  120.20
525         Adebayo, Bam  weightKilograms  115.70
1           Adebayo, Bam     heightMeters    2.08
2             Adel, Deng     heightMeters    2.01
526           Adel, Deng  weightKilograms   90.70
3     Aldridge, LaMarcus     heightMeters    2.11
527   Aldridge, LaMarcus  weightKilograms  117.90
4        Alexander, Kyle     heightMeters    2.11
528      Alexander, Kyle  weightKilograms   99.80

In [23]:
#pivot長轉寬
wide_format = player_profile[["temporaryDisplayName", "heightMeters", "weightKilograms"]]
long_format = pd.melt(wide_format, id_vars="temporaryDisplayName", value_vars=["heightMeters", "weightKilograms"], var_name="key", value_name="value")
long_format.pivot(index="temporaryDisplayName", columns="key", values="value").head()

key                   heightMeters  weightKilograms
temporaryDisplayName
Adams, Steven                 2.13            120.2
Adebayo, Bam                  2.08            115.7
Adel, Deng                    2.01             90.7
Aldridge, LaMarcus            2.11            117.9
Alexander, Kyle               2.11             99.8

In [24]:
wide_format = long_format.pivot(index="temporaryDisplayName", columns="key", values="value").reset_index()
wide_format = wide_format.rename_axis(None, axis=1)
wide_format.head()

  temporaryDisplayName  heightMeters  weightKilograms
0        Adams, Steven          2.13            120.2
1         Adebayo, Bam          2.08            115.7
2           Adel, Deng          2.01             90.7
3   Aldridge, LaMarcus          2.11            117.9
4      Alexander, Kyle          2.11             99.8

In [25]:
#簡單合併
import pandas as pd

upper_df = pd.DataFrame()
lower_df = pd.DataFrame()
upper_df["character"] = ["Rachel Green", "Monica Geller", "Phoebe Buffay"]
upper_df["cast"] = ["Jennifer Aniston", "Courteney Cox", "Lisa Kudrow"]
lower_df["character"] = ["Joey Tribbiani", "Chandler Bing", "Ross Geller"]
lower_df["cast"] = ["Matt LeBlanc", "Matthew Perry", "David Schwimmer"]

In [26]:
upper_df

       character              cast
0   Rachel Green  Jennifer Aniston
1  Monica Geller     Courteney Cox
2  Phoebe Buffay       Lisa Kudrow

In [27]:
lower_df

        character             cast
0  Joey Tribbiani     Matt LeBlanc
1   Chandler Bing    Matthew Perry
2     Ross Geller  David Schwimmer

In [29]:
pd.concat([upper_df,lower_df])

        character              cast
0    Rachel Green  Jennifer Aniston
1   Monica Geller     Courteney Cox
2   Phoebe Buffay       Lisa Kudrow
0  Joey Tribbiani      Matt LeBlanc
1   Chandler Bing     Matthew Perry
2     Ross Geller   David Schwimmer

In [31]:
#將索引弄正常
pd.concat([upper_df,lower_df],ignore_index=True)

        character              cast
0    Rachel Green  Jennifer Aniston
1   Monica Geller     Courteney Cox
2   Phoebe Buffay       Lisa Kudrow
3  Joey Tribbiani      Matt LeBlanc
4   Chandler Bing     Matthew Perry
5     Ross Geller   David Schwimmer

In [35]:
#左右合併
left_df = pd.DataFrame()
right_df = pd.DataFrame()
left_df['character'] = ["Rachel Green", "Monica Geller", "Phoebe Buffay", "Joey Tribbiani", "Chandler Bing", "Ross Geller"]
right_df["cast"] = ["Jennifer Aniston", "Courteney Cox", "Lisa Kudrow", "Matt LeBlanc", "Matthew Perry", "David Schwimmer"]

In [36]:
pd.concat([left_df,right_df],axis = 1)

        character              cast
0    Rachel Green  Jennifer Aniston
1   Monica Geller     Courteney Cox
2   Phoebe Buffay       Lisa Kudrow
3  Joey Tribbiani      Matt LeBlanc
4   Chandler Bing     Matthew Perry
5     Ross Geller   David Schwimmer

In [37]:
upper_df

       character              cast
0   Rachel Green  Jennifer Aniston
1  Monica Geller     Courteney Cox
2  Phoebe Buffay       Lisa Kudrow

In [38]:
lower_df

        character             cast
0  Joey Tribbiani     Matt LeBlanc
1   Chandler Bing    Matthew Perry
2     Ross Geller  David Schwimmer

In [39]:
#但不會更動到upper_df
upper_df.append(lower_df,ignore_index=True)

        character              cast
0    Rachel Green  Jennifer Aniston
1   Monica Geller     Courteney Cox
2   Phoebe Buffay       Lisa Kudrow
3  Joey Tribbiani      Matt LeBlanc
4   Chandler Bing     Matthew Perry
5     Ross Geller   David Schwimmer

In [40]:
upper_df

       character              cast
0   Rachel Green  Jennifer Aniston
1  Monica Geller     Courteney Cox
2  Phoebe Buffay       Lisa Kudrow

In [41]:
#若要更動到df
upper_df = upper_df.append(lower_df,ignore_index=True)
upper_df

        character              cast
0    Rachel Green  Jennifer Aniston
1   Monica Geller     Courteney Cox
2   Phoebe Buffay       Lisa Kudrow
3  Joey Tribbiani      Matt LeBlanc
4   Chandler Bing     Matthew Perry
5     Ross Geller   David Schwimmer

In [43]:
#一對一聯結（one-to-one）
left_df = pd.DataFrame()
right_df = pd.DataFrame()
left_df["title"] = ["The Avengers", "Avengers: Age of Ultron", "Avengers: Infinity War", "Avengers: Endgame"]
left_df["release_year"] = [2012, 2015, 2018, 2019]
right_df["title"] = ["Avengers: Infinity War", "Avengers: Endgame", "The Avengers", "Avengers: Age of Ultron"]
right_df["rating"] = [8.5, 8.6, 8.5, 7.3]

                     title  rating
0   Avengers: Infinity War     8.5
1        Avengers: Endgame     8.6
2             The Avengers     8.5
3  Avengers: Age of Ultron     7.3

In [44]:
left_df

                     title  release_year
0             The Avengers          2012
1  Avengers: Age of Ultron          2015
2   Avengers: Infinity War          2018
3        Avengers: Endgame          2019

In [45]:
right_df

                     title  rating
0   Avengers: Infinity War     8.5
1        Avengers: Endgame     8.6
2             The Avengers     8.5
3  Avengers: Age of Ultron     7.3

In [46]:
pd.merge(left_df, right_df)

                     title  release_year  rating
0             The Avengers          2012     8.5
1  Avengers: Age of Ultron          2015     7.3
2   Avengers: Infinity War          2018     8.5
3        Avengers: Endgame          2019     8.6

In [47]:
#簡單合併的話沒看參照的欄位,但聯結會看參照欄位,像上圖順序不同但合併完有照title這個變數合併
#當發現兩個df有相同的參數,就會對照然後合併

In [48]:
#一對多聯結（one-to-many）
left_df = pd.DataFrame()
right_df = pd.DataFrame()
left_df["title"] = ["The Avengers"]
left_df["release_year"] = [2012]
right_df["title"] = ["The Avengers", "The Avengers", "The Avengers"]
right_df["genre"] = ["Action", "Adventure", "Sci-Fi"]

In [49]:
left_df

          title  release_year
0  The Avengers          2012

In [50]:
right_df

          title      genre
0  The Avengers     Action
1  The Avengers  Adventure
2  The Avengers     Sci-Fi

In [51]:
pd.merge(left_df, right_df)

          title  release_year      genre
0  The Avengers          2012     Action
1  The Avengers          2012  Adventure
2  The Avengers          2012     Sci-Fi

In [52]:
#多對一聯結（many-to-one）
left_df = pd.DataFrame()
right_df = pd.DataFrame()
left_df["title"] = ["The Avengers", "The Avengers", "The Avengers"]
left_df["genre"] = ["Action", "Adventure", "Sci-Fi"]
right_df["title"] = ["The Avengers"]
right_df["release_year"] = [2012]

In [53]:
left_df

          title      genre
0  The Avengers     Action
1  The Avengers  Adventure
2  The Avengers     Sci-Fi

In [54]:
right_df

          title  release_year
0  The Avengers          2012

In [55]:
pd.merge(left_df, right_df)

          title      genre  release_year
0  The Avengers     Action          2012
1  The Avengers  Adventure          2012
2  The Avengers     Sci-Fi          2012

In [56]:
#多對多聯結（many-to-many）
left_df = pd.DataFrame()
right_df = pd.DataFrame()
left_df["title"] = ["The Avengers", "The Avengers", "The Avengers"]
left_df["genre"] = ["Action", "Adventure", "Sci-Fi"]
right_df["title"] = ["The Avengers"]*6
right_df["avengers"] = ["Ironman", "Captain America", "The Hulk", "Thor", "Black Widow", "Hawkeye"]

In [57]:
left_df

          title      genre
0  The Avengers     Action
1  The Avengers  Adventure
2  The Avengers     Sci-Fi

In [58]:
right_df

          title         avengers
0  The Avengers          Ironman
1  The Avengers  Captain America
2  The Avengers         The Hulk
3  The Avengers             Thor
4  The Avengers      Black Widow
5  The Avengers          Hawkeye

In [59]:
pd.merge(left_df, right_df)

           title      genre         avengers
0   The Avengers     Action          Ironman
1   The Avengers     Action  Captain America
2   The Avengers     Action         The Hulk
3   The Avengers     Action             Thor
4   The Avengers     Action      Black Widow
5   The Avengers     Action          Hawkeye
6   The Avengers  Adventure          Ironman
7   The Avengers  Adventure  Captain America
8   The Avengers  Adventure         The Hulk
9   The Avengers  Adventure             Thor
10  The Avengers  Adventure      Black Widow
11  The Avengers  Adventure          Hawkeye
12  The Avengers     Sci-Fi          Ironman
13  The Avengers     Sci-Fi  Captain America
14  The Avengers     Sci-Fi         The Hulk
15  The Avengers     Sci-Fi             Thor
16  The Avengers     Sci-Fi      Black Widow
17  The Avengers     Sci-Fi          Hawkeye

In [60]:
left_df = pd.DataFrame()
right_df = pd.DataFrame()
left_df["title"] = ["The Avengers", "Avengers: Age of Ultron", "Avengers: Infinity War", "Avengers: Endgame"]
left_df["release_year"] = [2012, 2015, 2018, 2019]
right_df["movie_name"] = ["Avengers: Infinity War", "Avengers: Endgame", "The Avengers", "Avengers: Age of Ultron"]
right_df["rating"] = [8.5, 8.6, 8.5, 7.3]

                     title  release_year               movie_name  rating
0             The Avengers          2012             The Avengers     8.5
1  Avengers: Age of Ultron          2015  Avengers: Age of Ultron     7.3
2   Avengers: Infinity War          2018   Avengers: Infinity War     8.5
3        Avengers: Endgame          2019        Avengers: Endgame     8.6

In [61]:
left_df

                     title  release_year
0             The Avengers          2012
1  Avengers: Age of Ultron          2015
2   Avengers: Infinity War          2018
3        Avengers: Endgame          2019

In [62]:
right_df

                movie_name  rating
0   Avengers: Infinity War     8.5
1        Avengers: Endgame     8.6
2             The Avengers     8.5
3  Avengers: Age of Ultron     7.3

In [63]:
#若只單純merge會錯誤,因找不到共同欄位,所以要用left_on等參數來告訴左邊和右邊用哪個欄位來參照
pd.merge(left_df, right_df, left_on="title", right_on="movie_name")

                     title  release_year               movie_name  rating
0             The Avengers          2012             The Avengers     8.5
1  Avengers: Age of Ultron          2015  Avengers: Age of Ultron     7.3
2   Avengers: Infinity War          2018   Avengers: Infinity War     8.5
3        Avengers: Endgame          2019        Avengers: Endgame     8.6

In [64]:
#交集（預設）
left_df = pd.DataFrame()
right_df = pd.DataFrame()
left_df["title"] = ["The Avengers", "Avengers: Age of Ultron", "Avengers: Infinity War"]
left_df["release_year"] = [2012, 2015, 2018]
right_df["title"] = ["Avengers: Infinity War", "Avengers: Endgame", "Avengers: Age of Ultron"]
right_df["rating"] = [8.5, 8.6, 7.3]

                     title  rating
0   Avengers: Infinity War     8.5
1        Avengers: Endgame     8.6
2  Avengers: Age of Ultron     7.3

In [65]:
left_df

                     title  release_year
0             The Avengers          2012
1  Avengers: Age of Ultron          2015
2   Avengers: Infinity War          2018

In [66]:
right_df

                     title  rating
0   Avengers: Infinity War     8.5
1        Avengers: Endgame     8.6
2  Avengers: Age of Ultron     7.3

In [67]:
print("Inner join:")
pd.merge(left_df, right_df)
#預設就是inner join

Inner join:

                     title  release_year  rating
0  Avengers: Age of Ultron          2015     7.3
1   Avengers: Infinity War          2018     8.5

In [68]:
print("left join:")
pd.merge(left_df, right_df,how='left')
#有nan是因為另一個df沒有

left join:

                     title  release_year  rating
0             The Avengers          2012     NaN
1  Avengers: Age of Ultron          2015     7.3
2   Avengers: Infinity War          2018     8.5

In [69]:
print("right join:")
pd.merge(left_df, right_df,how='right')

right join:

                     title  release_year  rating
0  Avengers: Age of Ultron        2015.0     7.3
1   Avengers: Infinity War        2018.0     8.5
2        Avengers: Endgame           NaN     8.6

In [72]:
print("outer join:")
pd.merge(left_df, right_df,how='outer')

outer join:

                     title  release_year  rating
0             The Avengers        2012.0     NaN
1  Avengers: Age of Ultron        2015.0     7.3
2   Avengers: Infinity War        2018.0     8.5
3        Avengers: Endgame           NaN     8.6

In [73]:
#用列索引聯結 df.join()
left_df = pd.DataFrame()
right_df = pd.DataFrame()
left_df["title"] = ["The Avengers", "Avengers: Age of Ultron", "Avengers: Infinity War", "Avengers: Endgame"]
left_df["release_year"] = [2012, 2015, 2018, 2019]
right_df["title"] = ["Avengers: Infinity War", "Avengers: Endgame", "The Avengers", "Avengers: Age of Ultron"]
right_df["rating"] = [8.5, 8.6, 8.5, 7.3]
left_df = left_df.set_index("title")
right_df = right_df.set_index("title")

In [74]:
left_df

                         release_year
title
The Avengers                     2012
Avengers: Age of Ultron          2015
Avengers: Infinity War           2018
Avengers: Endgame                2019

In [75]:
right_df

                         rating
title
Avengers: Infinity War      8.5
Avengers: Endgame           8.6
The Avengers                8.5
Avengers: Age of Ultron     7.3

In [76]:
#相同命名的就串再一起
left_df.join(right_df)

                         release_year  rating
title
The Avengers                     2012     8.5
Avengers: Age of Ultron          2015     7.3
Avengers: Infinity War           2018     8.5
Avengers: Endgame                2019     8.6

In [77]:
right_df.join(left_df)

                         rating  release_year
title
Avengers: Infinity War      8.5          2018
Avengers: Endgame           8.6          2019
The Avengers                8.5          2012
Avengers: Age of Ultron     7.3          2015